content/daily/2022-05-09.md
+++
title = "2022-05-09"
author = ["System Administrator"]
draft = false
+++

## The braindump repo! {#the-braindump-repo}

I needed to write a good dps. But I can't get it right.
Therefore, I dicided to

1.  [X] tag everything draft
2.  [X] rsync the whole RoamNotes into braindump/org/
3.  [X] tag checked node "not draft", call `hermanhel/sync-RoamNotes` after that
4.  [ ] make a private repo braindump-source
5.  [ ] use [this tutorial's github action](https://jandelgado.github.io/blog/posts/github-pages-with-private-repo/) to push the build from braindump-source to braindump
6.


### tag everything draft {#tag-everything-draft}

```emacs-lisp

(setq org-files (directory-files-recursively ".." "\.org$"))
(print org-files)
(dolist (org-file org-files)
	(with-temp-buffer
	  (insert-file-contents org-file)
	  (org-mode)
	  (search-forward "#+title:")
	  (end-of-line)
	  (org-return)
	  (insert "#+filetags: :draft:")
	  (write-region (point-min) (point-max) org-file)
	  )
	)
```

<div class="src-block-caption">
  <span class="src-block-number">Code Snippet 1</span>:
  1.
</div>

```emacs-lisp

(defun hermanhel/sync-RoamNotes ()
  "sync my RoamNotes into the private repo of braindump"
  (interactive)
 (start-process-shell-command "rsync" "*rsync*" "rsync -avz --progress ~/Notes/RoamNotes/ ~/playground/projects/braindump-source/org/"))
```

<div class="src-block-caption">
  <span class="src-block-number">Code Snippet 2</span>:
  2.
</div>